node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 4306905
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\306\302Z\276\304,\331=\022\340g\276\350\220\257\274\205\031i<!t\021\276\214*A>\235IH\276\362/\030\276\311_\235>^\320\234\274 \025r=\241}$>n\370\213<e\021S\275\306\300n\275\243\271\253=\020\227\002\274\2443\253;\344a|=T\210\030<\343\"!>\252\361\211=}\217\n\276\234\344x>nzw>\000T\373\274\345M\033>{\312\272=\034\0241<1\334:\275j\230\353\275\250\311\327\275jR\014>\226\203\216=\007\356\377\274{5\352\275GW^\275\2567\354\275kR\031\276\253\215\236=2\277 <\027\022\341=h\361\223\275\311]{<\2152\337=\367C\234=\317\254\330\275\031h\270\276\353&M9_\253\375=\211EM\276\373\320+>Z\324\013>M\244/\275\250:\343\274\307\3404=\223}\260=\316\215A>\250M\006\275\343.*<\3427\032\276\304i\003\276\375\352\366<\217\232\361=\320l\273\276\220\t\364\275\230\213\223\272=\273\352\275\343\333\235\276\270\252/\274Pb\021>x\274\270\274\364\342\340\275\336\001\316=)\002\265\2755\307\241\276<\\\362=\374hK>K\252l\276\303\035\030\275\346i;>\350\025\231\275i\2169\276w\324+\275|^\365=\360t\230\274\326\264\376=\267\314\027=\367\033\377\274?\025d<\376A-<\332\007\033=\341S\036>\247%E>\261\007Y=\036\020j=3\026F\276j\006\230\274\035\322\321\275\t)\270<\004\355><\343\"3\275\317*\233\272\315-\311\275\027\311X\276x\263\326\275\330\326\245\275[\014\222=\230{P>*\355\r\274\205eH=\276\235\3279\022xh\274C\n\317\275s\t\030\276n\004\214\275\200\334\033>\002\242\341\275a\225\332\275\013\036;>\273j\031\276\252\302\357\275Fn\237\276\274\251/=\350\360\014<\235\262\013\276\0369R>(\013\316=\365\030y=\010\tw\275;m\341\275\224k\216<\250 \005>\375\206v=V\342\'\276\245\023n\275\2166\326\274lBg\276\r\371\205=A\240\n\276\244\307\231=l\216\263\274W \264\275}\361R\276d\351\317\275\014\353b>\231q\203=\377\245,\276T\247\226\275\366\t\275\275\334F\215<X\337\035\276g\262\253\275\027\221\226>\027\027\356\274\004\336\354\275n[\034\274\306\346n\276\255(\030\276\022\016\205=\365\216\202\274xkU<\rkk<A\360\t\276\311\200\265=\016\362\026>\365\037C\275\"P\235\276\302\346\003\275\277\346\016\276\377\304\235=\001p\336\275+]\301<M\025A=\371\216\215=#\000\233=cp\300\275\341z&\276\256\377\304\275V)\r\276\016\307\267=R\334#>-\3166>c\244\260>\263\366,>\234Hk\276c\264\241=\031\276\257=-\347\365=q\375d=\367\256\010>\207\316D;\217\006(\273\001\261Z\275\271\"\233=)\213E>\235b\303=\354\350\353=\031\017e\276\227\206\343;\246\201\275;0\303\356\275o\371\271\275\252\324{\275n\\\230=\262\022?>J\332F<\007\270\374\274\001\212=>BJ0\276\204I\243=\023jq=\332\204\271=\364\352\001>\205VN\276\024\260\005\2752\223(=l\272\227\274\304\311\352=CQ\246=M\301\220\275l\\\260=\304\266\213\276j`#\276E\317$=&\207\203<2\362\342\274\227\263\002\275\200p\203\276\242\017\n=G\374\273=\315\n\223;\363\307N\276\221S\\=\2611E\276\232k\004>U<!>|?\201;=r\230\275\262\270\371\275\324fR\276z\237^\275?\321\307\275\017\316\361\273K\0309>>\333\314=s\330\217=\264C\347\275P\336\373\275\002\006\210\275\346\001\027=\252Rs<\267\260\342=\372\013\016\275b\356\243=\352\007\211=\302\231\232\275\300\371j\27676\242=<\217\230=\004\331\001>\\\335k=iZ\'\276Y5\025=\336\314\251=b<\245\275\302\004\212\275\374:\243>\344x\311<\3105\001>\337e(\276\337/\262=\001\226\034=\025t\022>\246\217\n>29\306\275\272(\207=`\033\223=\316\346\231\275D\241\215\276H\260\306<2R\213=\030\027O\274\001\003p\275\331\264\027\276\'\255\225\276\273\242m>K\223\025\276\214\001\025\276K\237\230=\020\334\331=lN\013\2761m\251\276?\000:\273F\250\227\273\313\223\356=[\250\232=*\363\315\275\377R\270=DAo>\304\3265\274\264\005\224<\304\371\263\275\337\260\007\276\374\372\253<\236\207A\276\307g\207\275\234\205\205\275\001\032\016\275I\312\021>\312\226\004\276v\0062>e\024\311<\327\030p\275\357\006!\276|\233:=\205i\240>(\342\201=\325@\374=\020\237\316\274\033\013G=+\224%\276\022\'\324\273q\2219=\036K\210\274.\312Z\274\350\033\332\275\326k\r\274C $>\226\253\025\276\252%\251\275\310%!=\364\010\223\276\034\r\361=$1\272<(\243\340\275i\372A=b\223\245=\323^\201=\273f\242<\213\352\266<\037\345\'\276D\006\203\275#\355\211=\256\256\0269Nc\374\275-\332\257\273\353{\215\271e\301r>u\333\222>\277\2119=\3727\226>\033W\"\276t\221\025\274\215\273=>\246\257`>\203\023<>\343,\010> \365\334\274\320\245z=S\301H>\210;\374=i\274\253=1\366+\275;63>\313J\241\274\001\016B>\316\256\326=\272;\225=hD!>\337ri\275\357\336\303\274j\243\301\273\246j\n\273\035\312\265=\026&]=\347\007\300\275gk\340\275\304\177\276\276\373\212\371\275\t\345\202>\2700\262\275\353\322\213\275\354*\022>\014\375\221=\252\224\344\275\026\250k>\005\231\342\274%\t\364=@f\231\275\323\030\005\276\353\030P\275\225\341\334\275\271\255\245\275\200\346\211>p_\253=[\367t\275\372x\014\275\361\013:\276\313\037P>\334;g>/\312@\276]\'Z>-\211{\274u\324h\275\273g\270=\353~\202>\305\356p\275p\324\265=]\256\265=\355\360\342<\2306F\275bQ]<\302\242\316=\n\235>\275\212\325\203\275\237\302.<\227\226\330\274\241dv=\223\'\312=\304EN>\030\374\201=\362\027{>\321[\220=j;\347\274\352\376N\274\356>@=\212\003V>\0372:\276\220\237\214\2752\341\001>\\\274\002\271\377\332\025\275\236\3271>B|e=\374\320s\276\276Va<&\306\212\274Y\317\217=\310H\266\275\261\001s\276\266,\355=\333\353m\275\362\327\007>#y\324=\017\313/\276J\006o\275u\314&>\314C{=\230\316d=\222Y\001\275F\227\362\275\024\362\300=\247H\201>\375\350%\276j\215\367\275\013\001)>,\377\321<H\341\010\274\326\272L>T\235=\275\320\325\304\275\300&\007\276el\006>|j\037\274\306P\364;Ep\220=K\036)\276N\026\307\273\225\243\024>\362;\225\275!C\312\274\216S\212=)\372O>\227Z\225>\030\230\235<y}\327\275\037\212h\276\"\177\334=r\201\371\274EA;\276QSU>p\350)\275\357FO\275fBq\2765\304\347\275\251\213\215>\341\342^=\322\224\357=]\372\202\276YK\334=\315\t\">\245:\315\275\016\375\032\276\"\356&=\321\267\376=J\365\026\276#_\222<\216G\360=^\235\010\276l\367;\276\306\337\375=\252\'\256\2751\347,\275\306\030\037>\205Q\367\274\\\221\341\274\302\004\030>\360\350\350<Z\007\340\274\211\002\002\276\247\277!>pb\201\275A\223\001\273\312\323S=2V]\275\177J\343\275F8\361=\\q!=\352\340\303=\256E\260=!\337\241\276\310Rk=\024\334x\276OQ\375<\236;\220\274\361V\036\276}\273\243=VrF=\t\323\310\275\242\364#\276\247\036\000\276O\230\274=,\361\t>\344\003g\275W\207;>8z\241<Z\317=>W\246e=\347\362\241=\224\"\027=\253\014c\276}1<>Uq[=~\200\220\275yP\203>\206\010\010>\332\273\217=\344\020\360\275\334r{>\255\202\302\275\246\035}=s&5\275\215\2542\275\252\377\322=\266\261\271=wF?\276e\226\316;\032{\324<\3747\'\276\275\003\260;\267s\t\276<\315@>\\.\004\276\2678\232=\347Q\005\276\210(\246\276d*\332\275c\351\001\276<\230n\275\362x<\276k\265==m/\377=\257IC=\257n\312=\013\364\210\276{\374\036>Ul;<\206\204b\275\336\002\320;\256G5=\274\312\232\274\354\310]\276\356\\p\275\233\276\006>\216E\312=\320<\026\275\013\240\2419-N1>wqd\275\204\264S>\311\344\013\276\330^.=\326i\245\275\334\024\010\276\303/\263\274\224,O>\276f\247=\216\022\223\274\243dG>0 t\275\0054/\276{\3549\275M\245y=\220\311s=\330\025\220=\344B\024>\033\177\204\275CL\207>n\316\267=\337m\347=\256j@=\315rO>\036\022\177>\037W\034=w9\272=[\014\242\274\232\027\257>\222J_\275\361I\033=Tw-\274<\250\246\274\\`\366=\310\317\245\275H\335+>\000e\r\276F\021\003=\36380>?t\363\275\365\232\204=\212\363C>\216^\033<\360\261\252=\371\033\206>\244%\365=;-V>\305\262\205=\260\302\324\274\006Ti>\254\307\024=\216\2525=\214\352\305=P\215\030>-nc=@\014\363=\r\325\335\274\222\342\366=\032\251m=\272:\035>\3274<\275\252\330\217\273\323\246W\275\r\252\340\275`\215\320=\237%\336<b\2073>g\271G\276\273\237\004>\020\206\311\275{N\273\275^ \330\275q9\207>\332<]\275?\314a<p1\233:\314h;\275\340\'\020=\306\363X=N\273\366<o\235;>\376\221\222\276\343$}>\021N\343\275\366JN>\327\300\014>\325\350\342\275\274\362\200\2754\006\372\274n\034:>\343r\252\274\3578\231\274\365\0015\276\333Lg\275\277\362\233=\000J\223\275\004\222\244;\225oQ\276G~\030>$`]=Z\276\316\274\266\"\000>]\351f\2768W\227>\360\362\265\274\266{\244<\377Q\373=\230\230\324<\261\370\201\276\215\376\271=\366\347\223=\tW\245\275\372\316d\275/z\335=\243G]\276\017\325(\274\274\335\213\275\271s\356=\204\274N\275\315\245h=\000\341\331\275\310z;\276%`$>\273\246\324\275`k\r\276\205\230/\275\307\333\'\276\260e\307=\235\2527=\357\013\253=U\266M=\325\257\252=\n\212l=m\354\221=s\314\314\275\341\312\315;-\311A\274\307\313\375\274\235\267\007\276DYj=p9\206>uU\005\276\034\017S>\206\272\005=\362\206\215\274\324\032x>tqt\274\035V!\275\322\312~=\233)\033\275N\341\002>\272\026\356=\036\306\245>\036\343*\275\003\005\177\275k\304\214\273\270#H=\t\036\016>\224I#\275P\334\001=Z7Q>\2645\275\275\364`\273\275\026\302@\275\221\317\375<\363\362=\276\236\225\267\275*X2\276{W\206\276>\251\007\275 L\367\275\262\334\"\276L\255\352\275\231H\275\274\307\200\r>{\366\317=>c\r\276}$\032\276\004\361\037>&\237\314=\262\006O\276{\360\345=\001\345\016\275\362\tX\274\027\303\235>\215\031(\2754\333\022>E5\017>\343O!\276^+\317=\331\217\204\273\267\000\002>\005;6>\316\3076\275BH\331\275\236\202\233\276\256\253\333=\357\310\301\275\301N\236=\220|N\275C\345\261=\350J*\275\026\017\017\274K\036\016\2750\337i>q\231\317\275\251\276`>\377\205P\275\031Q>\275\335D\355\274\301\262\017>8\271\221<\300\373\320=\r\330o\275m[\251=7\267\204\276\230\251\007>\032\231]=\033t2>~\2360\2760]7\276\201%+=\340\207\177>\016t\305\275\266$\034>\234\257Z\275S\224\322=1\033z=\361\356\357\275\230\004\343=\375x\211\275R\330k\274\360\212\360\274\2103\265\275v#\024\275%\316/<.\025\267=B\202~\274\243\211\367\275\350\366\r>\311\340\230>}\300\005>\352\002?\276\256\216\340\274<#N=\304a~\276\345p\267\275\311\005\327\275\222\276\232<-Ha>\200U\343\275u\336c\2751\304\017;\236\177\004>|\231\214>|\232+\275\306U\376=\236\260V\274`\247Y\275x\251\031\276\267\246\255\275\321\220\200\275\217\022\344=\220G\001>\306\270:>\345\323\323\275\017\330\205>8\307\244\275K\006\361\272S2\250=\344R\230<\031\025\021\275O\036\224\276\264\003\311=\355\205\237\276\000w\003>I~:\276\316Hc>P+\324;\245X\373=\032\317\316\275hY\260=\252%\221\275\016iA\276r\224\347\275\244\364C\275\007\322\000>\330\003B=\030i)\276\302U\225\276@?*\276\230\"\326<&\264\323\275wr\317\275\306\320\243\272\300&\254\274?\332\002\276Yi\013\276R\331w=-\223\355<\335D*=\336\206\000\276\376\254?=k\344\001=r\307\212=\020N\350=\373\004\017\275\257\226\313\275\372\007\212\275A 7>\010R\177\275\014\270:\275I\265\221\274\004\363o=\025\264\334=\363\002N>H\032\240<\375Ss>\373\337J\275!|\017\276q\3565>\303\003\213\275\331u\203\275j\353j\275Rl\313\273\372\350c\276\201\036\220\276\0010\330\272\231\003\'<\347\362G>S\353)\275jd\234<\\\304\276=)\000\240\274\313\3366\275\215)B\274\364;e\276\300{\036\274\261h\240\274\202a.>mR;>\364N\332;\203b*>\377\213\231\275\201\022n\275%6\364:\307\035\\>\022\265V\276L;\002=\301T\226=\014\273\n\276\032)3\275\246fn=\006e\326\274K]\031<\355e\031>\035\255\307>\255\236\312\275NcB\276\255\026\231\273$I\005>0\007\357\275`\006\203=c\337\221\275\334\230\231=DD\202\276\256\243\014>-\021\006<7\202\031=\215Z\360=\254\017\202\275\316\303\270\275\314\032\030>\301\222^\275\215\365\224\276\257X\270=h\0051;\030K\371\275K\201\311\275\340\212\254\274\031\251Q\276\'\253D\275\034\277\243\275F\033\237\275T\354\230\276\005R\367:\306\312\323\275e\234E\276I\353\202>\016x >\357\360\200\275\212[\243>.{\215\275>\263\014\275^\355t\276p\371J=\312\000\225\275\270\247\005\274\215\261d=V\227\363\274\034\242\300\274\247\032\020>\201\371\257<\344\021\223=\246\234\330=\361c&\2756\340\003>H\351\266=J\200\017\276\336\235\267\275\264*\227>@\2613=\023\307\034<\364dK\276\036\034\344=gG\006>\026]\250=\016\3753=\307T\247=\355\033\225\275\r\177\035>\326m\332=\3336\316\275A{\344\275\2517\003>N\264\277=\347\201\020\276\224XX=\261\237\002=\020\371\203=\020\262\273\275{\347\324\2740?{\274!_\020\275\247\273\177=\304\3214>\264\325\273=\314!\257\275\335+\261\275R\264\240=\365k\032>&\346\212\275\242\010\222=\232\247\211\276\303u\352\274\263\363\244=~\200b\274#\367\356<ymF>d,Q\275\336\274\356\275\'\372E=^\311\337=\343\'S\275\375V\360\275\240%2>\233\n9>\231\003s\2750\216/\275\323\035|\275 \006\373:r\200[>\320\327\037=7\016\247\275@\355\346\274}\213\316=\217\227\000\2762\361\023\273\223\2631>i\346%:\344\360\212\276\002P~\276G\365_\276\030\3235<\223\005\214\276\222$b\275>\0200=\345x\225=(\032\000\276)-\222=>s\202>i\271N\27565\325\275Sk\001>b\366\005>\020\2229>\305\301F\276\207\303:\276\262\001\327\275\177\007/\276\363l\361\274\032\213\003\2763\033\335<\\\004Q\276\23299\274\321\021\364=n>\364\274,\'\212=\270\3337;+-D\276\022\356\332=\235H\201=\035\325 \275(\267L>w&\017\274\255%\000>((\014=\262\224o<r^\231>\260\322\220=u\206\376=\0250\336\274D9\030\276\367+O>\252D\326>\262\371\274\275\212\241!>|v\200\275\227\371\030\276\022D\n>\027\355\305=\337\327u\275\300\033\254<\334\r\014>0J\305=7E\260\275\277>\336<\272^\333=\3776\003<\265\'\250\276\266b\347\274<\006\223=\3164\n\273}\373\273=3 \301\275\304\271\364\275\262V,=\233\225X\276\221!\006\274\204\005\203\274\303\327\326=:\340\210\275\2368T\276\206f\273=\231!T>\2619+<\r2\223\274\r\264\037\272\002\265\007>h\316)=z}\213\276!\313k\276TbH\274\n\177\365<\275\213\375<\005b\223=\274\203\252=\233\037\342\275\024\230\356={\337\303=\332\2049\274y\225j\276\341+\261=\365\002\223>\244\255\233=\342\332\025\274\027$\037\2760\247\212>\355\351+\275\"b\315\275\376\271\305<\342\372\231\275\365\355\017\276\006\331\001\276R\001V\275-\261\310\275#\373\240=B\352\214=\016\305\324<\223+X\275;(\334=pNL=(\036\307<D[\257<v\350\013>\241\257\221=rN\010\276cV\n\276\3321\010>\3002\006>\254\311\225\274-G}>E\323\024\276*\323k\276\021\241\030>\323d\350=/\356\244=\006 D>fA\025>\333N\007\274\311\253\326\2739\035\307\275\337\0336\276\323\244\211>(\375\264=\027a>\274ayS\275\276U\375=\310\227\211=j\n\275="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
